org/api-for-mortals.html
<!DOCTYPE html>
<html>
<head>
<title>Mundane Clojure for Mortals: Let's build a Web API</title>
<!-- 2015-03-05 Thu 08:06 -->
<meta  charset="utf-8">
<meta  name="generator" content="Org-mode">
<meta  name="author" content="Nils Blum-Oeste">
<link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/highlight.js/8.4/styles/monokai.min.css">
<link rel="stylesheet" type="text/css" href="https://maxcdn.bootstrapcdn.com/bootstrap/3.3.2/css/bootstrap.min.css" />
<link rel="stylesheet" type="text/css" href="weave-resources/htmlize.css" />


</head>
<body>
<div id="content">
<h1 class="title">Mundane Clojure for Mortals: Let's build a Web API</h1>
<nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Introduction</a></li>
<li><a href="#sec-2">2. Setting up a new project</a>
<ul>
<li><a href="#sec-2-1">2.1. Project automation and dependecy Management with Leiningen</a></li>
<li><a href="#sec-2-2">2.2. Create your new project</a></li>
<li><a href="#sec-2-3">2.3. Adding some basic dependencies</a></li>
</ul>
</li>
<li><a href="#sec-3">3. HTTP handling: One Ring to rule them all!</a>
<ul>
<li><a href="#sec-3-1">3.1. Handling our first HTTP request</a></li>
<li><a href="#sec-3-2">3.2. Convenience: Ring plugin for Leiningen</a></li>
</ul>
</li>
<li><a href="#sec-4">4. Better responses: Ring middlewares</a></li>
<li><a href="#sec-5">5. Convenient routing with Compojure</a>
<ul>
<li><a href="#sec-5-1">5.1. Namespace setup</a></li>
<li><a href="#sec-5-2">5.2. Some functions to produce "meaningful" output</a></li>
<li><a href="#sec-5-3">5.3. Defining routes and their handlers</a></li>
<li><a href="#sec-5-4">5.4. Complete namespace</a></li>
</ul>
</li>
<li><a href="#sec-6">6. Always respond properly: Liberator</a></li>
<li><a href="#sec-7">7. Sweet APIs: Compojure-Swagger</a></li>
<li><a href="#sec-8">8. Authentication and Authorization: Buddy</a>
<ul>
<li><a href="#sec-8-1">8.1. Stateless authentication</a></li>
</ul>
</li>
<li><a href="#sec-9">9. Connecting a database</a></li>
<li><a href="#sec-10">10. Integrating other HTTP services</a></li>
<li><a href="#sec-11">11. Deployment</a></li>
<li><a href="#sec-12">12. Automated Testing</a></li>
<li><a href="#sec-13">13. Appendix</a>
<ul>
<li><a href="#sec-13-1">13.1. Important Ring Concepts</a></li>
<li><a href="#sec-13-2">13.2. Frameworks / Boilerplates</a></li>
</ul>
</li>
</ul>
</div>
</nav>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
This project illustrates the basic of building a web API with Clojure. Empasis is on using simple approaches, allowing
Clojure beginners to get started easily. It's not about illustrating the best, state-of-the-art way of building such
an API with Clojure.
</p>

<p>
For a more sophisticated, advanced and structured approach have a look at <a href="https://github.com/weavejester/duct">duct</a> for example.
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Setting up a new project</h2>
<div class="outline-text-2" id="text-2">
<p>
You need to have <a href="https://www.java.com/en/download/help/index_installing.xml">Java installed</a>. Things should also work with the .Net CLR, I don't have any experience or interest in
that. Should you try the CLR, please let me know how it goes.
</p>
</div>


<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Project automation and dependecy Management with Leiningen</h3>
<div class="outline-text-3" id="text-2-1">
<p>
To manage the project dependencies, build the project and handle various tasks during development we are going to use
Leiningen. Leiningen is a de-factor standard in the Clojure world and very mature.
</p>

<p>
To get Leiningen simply follow the installation instruction on the homepage: <a href="http://leiningen.org/">http://leiningen.org/</a>
</p>

<p>
Recently <a href="https://github.com/boot-clj/boot">Boot</a> was introduced as an
interesting alternative, especially when working on an application (in contrast to library). If you are interested,
please have a look at <a href="https://github.com/boot-clj/boot">Boot</a>, too!
</p>

<p>
In the following sections we are going to use Leiningen and you will learn about how to use it on the go.
</p>
</div>
</div>


<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Create your new project</h3>
<div class="outline-text-3" id="text-2-2">
<p>
To get started, create a new project using Leiningen:
</p>

<div class="org-src-container">

<pre class="src src-bash">$ lein new api-for-mortals
</pre>
</div>

<p>
This will create a new project in a subdirectory called <code>api-for-mortals</code>. The project name is also used for the
Clojure namespaces being created.
</p>
</div>
</div>

<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> Adding some basic dependencies</h3>
<div class="outline-text-3" id="text-2-3">
<p>
The central point for the declarative leiningen project configuration is <code>project.clj</code> which can be found in the
project's root directory. It should look a lot like this:
</p>

<div class="org-src-container">

<pre class="src src-clojure">(defproject api-for-mortals "0.1.0-SNAPSHOT"
  :description "FIXME: write description"
  :url "http://example.com/FIXME"
  :license {:name "Eclipse Public License"
            :url "http://www.eclipse.org/legal/epl-v10.html"}
  :dependencies [[org.clojure/clojure "1.6.0"]
                 [ring/ring-core "1.3.2"]
                 [ring/ring-jetty-adapter "1.3.2"]
                 [ring/ring-json "0.3.1"]
                 [compojure "1.3.1"]
                 [metosin/compojure-api "0.17.0"]
                 [metosin/ring-swagger-ui "2.1.1-M1"]
                 [buddy "0.4.1"]]
  :plugins [[lein-ring "0.9.1"]]
  :ring {:handler api-for-mortals.server/api-app})
</pre>
</div>

<p>
This defines your project. The first two parameters to <code>defproject</code>  are the project name and the version,
<code>:description</code>, <code>:url</code> and <code>:license</code> should be self explaining. <code>:dependencies</code> is a list of lists definining the
project's dependencies. As you can see, Clojure itself is a dependency of the project. This makes it very easy to use
a specific version of Clojure in your project (and another version in any other project).
</p>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> HTTP handling: One Ring to rule them all!</h2>
<div class="outline-text-2" id="text-3">
<p>
<a href="https://github.com/ring-clojure/ring">Ring</a> is a Clojure library to handle HTTP requests with similarities from Python's WSGI and Ruby's Rack. Ring is
another de-factor standard in the Clojure world. Many other libraries build on top of Ring.
</p>

<p>
To use it in our project, we need to add it as a dependency in <code>project.clj</code>. Add these two vectors to the depenencies:
</p>
<div class="org-src-container">

<pre class="src src-clojure">[ring/ring-core "1.3.2"]
[ring/ring-jetty-adapter "1.3.2"]
</pre>
</div>

<p>
We added the core ring module and the HTTP server http-kit.
</p>

<p>
The next time we run any <code>lein</code> task, it will automatically pull the libraries from <a href="https://clojars.org/">Clojars</a>.
</p>
</div>

<div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Handling our first HTTP request</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Nothin more is needed to start building our web API. To actually handle requests, we need to define Ring handlers.
Handlers are functions which take a map representing the request as input and return a map representing the
response.
</p>

<p>
Let's write our first handler in <code>src/api_for_mortals/core.clj</code>:
</p>

<div class="org-src-container">

<pre class="src src-clojure">(ns api-for-mortals.core)

(defn hello-handler [request]
  {:status 200
   :headers {"Content-Type" "text/plain"}
   :body (str "Hello " (:body request))})
</pre>
</div>

<p>
This simple handler is a pure function and their at no dependencies for the namespace at all! It simply transforms
the input map (request) to an output map (response), operating on simple, basic data structures.
</p>
</div>
</div>


<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> Convenience: Ring plugin for Leiningen</h3>
<div class="outline-text-3" id="text-3-2">
<p>
We can make using Ring a bit more comfortable by using the Lein-Ring plugin. Add this map to <code>project.clj</code>:
</p>

<div class="org-src-container">

<pre class="src src-clojure">:plugins [[lein-ring "0.9.1"]]
</pre>
</div>

<p>
The entry point for ring gets defined like this:
</p>
<div class="org-src-container">

<pre class="src src-clojure">:ring {:handler api-for-mortals.core/hello-handler}
</pre>
</div>

<p>
Now run <code>lein ring server</code> in the project root directory to start your web application. Head over to
<a href="http://localhost:3000/">http://localhost:3000/</a> to see the response from your ring handler.
</p>
</div>
</div>
</div>
