org/api-for-mortals.org
* Better responses: Ring middlewares

  #+BEGIN_SRC clojure :noweb-ref project-dependencies
  [ring/ring-json "0.3.1"]
  #+END_SRC

  Creating a new handler which returns the request map as json data:

  #+BEGIN_SRC clojure :tangle ../src/api_for_mortals/simple.clj
  (require '[ring.middleware.json :as json])
  (def hello-json-handler
    (json/wrap-json-response
      (fn [req] {:status 200 :body (dissoc req :body)})))
  #+END_SRC

  =request :body= is an InputStream which cannot be parsed by the json middleware, thus we remove it from the response.

  Let's also update the ring config to use the new handler when running =lein ring server=:

  #+BEGIN_SRC clojure
  :ring {:handler api-for-mortals.simple/hello-json-handler}
  #+END_SRC

* Convenient routing with Compojure
 - COMMENT Put this before ring middlewares?

   [[https://github.com/weavejester/compojure][Compojure]] is a popular library to handle routing in Ring applications.

   To use it, simply add the dependecy to =project.clj=:

   #+BEGIN_SRC clojure :noweb-ref project-dependencies
   [compojure "1.3.1"]
   #+END_SRC

** Namespace setup
   :PROPERTIES:
   :noweb-ref: api-app
   :END:

   Setup a new file and namespace for the compojure handlers:

   #+BEGIN_SRC clojure
   (ns api-for-mortals.compojure
     (:require [compojure.core :refer :all]
               [compojure.route :as route]
               [clojure.edn :as edn]
               [ring.middleware.json :as json]
               [ring.middleware.params :as params]))

   #+END_SRC

   - compojure :: =compojure.core= has the main functions we need to define routes with compojure and =compojure.route=
        offers a convenient, premade route to handle missing routes with an 404 HTTP error.


  - clojure.edn :: [[https://github.com/edn-format/edn][EDN (Extensible Data Notation)]] is a data format, a subset of the Clojure data notation. It's worth having a look at
       it. Here we are only using it to coerce string parameters from HTTP requests to integers via =clojure.edn/read-string=.


   - ring.middleware :: =ring.middleware.json= we already know, we use it to build proper JSON responses. =ring.middleware.params= is used to
        extract parameters from the request's query string.

** Some functions to produce "meaningful" output
   :PROPERTIES:
   :noweb-ref: api-app
   :END:

   #+BEGIN_SRC clojure
   (defn rnd-int-in-range [min max]
     (+ min (rand-int (+ (- max min) 1))))

   (defn randomizer [min-str max-str]
     (let [min (edn/read-string min-str)
           max (edn/read-string max-str)]
       (rnd-int-in-range min max)))

   #+END_SRC

** Defining routes and their handlers
   :PROPERTIES:
   :noweb-ref: api-app
   :END:

   A small collection of routes.
   #+BEGIN_SRC clojure
   (defroutes api-routes
     (GET "/bounce-request" request {:body (dissoc request :body)})
     (GET "/users/:id" [id] {:body {:name "foo" :id id :role "admin"}})
     (GET "/randomizer" [min max] {:body {"randomNumber" (randomizer min max)}})
     (route/not-found {:body {:error "Page not found"}}))

   #+END_SRC

   Wrapping the routes with ring middlewares to get parameters from requests and produce JSON output in the responses.
   #+BEGIN_SRC clojure
   (def api
     (-> api-routes
       params/wrap-params
       json/wrap-json-response))

   #+END_SRC

** Complete namespace
   #+BEGIN_SRC clojure :noweb yes :tangle ../src/api_for_mortals/compojure.clj
   <<api-app>>
   #+END_SRC

** Update ring entry point

   Update the entry point for the ring server in =project.clj=  to use our new, improved handler:

   #+BEGIN_SRC clojure
   :ring {:handler api-for-mortals.compojure/api-app}
   #+END_SRC
* Sweet APIs: Compojure-Swagger
  https://github.com/metosin/compojure-api#sample-minimalistic-swaggered-app

  Add the dependencies for the API library and the API testing UI to =project.clj=:
  #+BEGIN_SRC clojure :noweb-ref project-dependencies
  [metosin/compojure-api "0.17.0"]
  [metosin/ring-swagger-ui "2.1.1-M1"]
  #+END_SRC


  #+BEGIN_SRC clojure :tangle ../src/api_for_mortals/swagger.clj
  (ns api-for-mortals.swagger
    (:require [ring.util.http-response :refer [ok]]
              [compojure.api.sweet :refer :all]))

  (defroutes* api
    (context "/api" []
      (GET* "/jolts/:id" [id]
        (ok {:id id}))
      (POST* "/jolts" []
        :body-params [body :- Long]
        (ok {:data body}))))
  #+END_SRC

   #+BEGIN_SRC clojure
   (require '[api-for-mortals.swagger :as swagger])

   (def api-app
     (let [old-routes (-> api-routes
                        params/wrap-params
                        json/wrap-json-response)
           new-routes swagger/api]
       (routes new-routes old-routes)))
   #+END_SRC
* Authentication and Authorization: Buddy
  Buddy is a small set of libraries for authentication and authorization including the needed cryptography, hashing and
  message signing. If needed these libs can be used independently.

  Add dependency for 'buddy' meta package, including all these libraries:

  #+BEGIN_SRC clojure :noweb-ref project-dependencies
  [buddy "0.4.1"]
  #+END_SRC

  Buddy supports multiple auth mechanisms, including HTTP basic auth, sessions and tokens, as well as stateless
  authentication. We are going to use the latter one.

