org/api-for-mortals.html

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Better responses: Ring middlewares</h2>
<div class="outline-text-2" id="text-4">
<div class="org-src-container">

<pre class="src src-clojure">[ring/ring-json "0.3.1"]
</pre>
</div>

<p>
Creating a new handler which returns the request map as json data:
</p>

<div class="org-src-container">

<pre class="src src-clojure">(require '[ring.middleware.json :as json])
(def hello-json-handler
  (json/wrap-json-response
    (fn [req] {:status 200 :body (dissoc req :body)})))
</pre>
</div>

<p>
<code>request :body</code> is an InputStream which cannot be parsed by the json middleware, thus we remove it from the response.
</p>

<p>
Let's also update the ring config to use the new handler when running <code>lein ring server</code>:
</p>

<div class="org-src-container">

<pre class="src src-clojure">:ring {:handler api-for-mortals.core/hello-json-handler}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Convenient routing with Compojure</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li><p>
COMMENT Put this before ring middlewares?
</p>

<p>
<a href="https://github.com/weavejester/compojure">Compojure</a> is a popular library to handle routing in Ring applications.
</p>

<p>
To use it, simply add the dependecy to <code>project.clj</code>:
</p>

<div class="org-src-container">

<pre class="src src-clojure">[compojure "1.3.1"]
</pre>
</div></li>
</ul>
</div>

<div id="outline-container-sec-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="section-number-3">5.1</span> Namespace setup</h3>
<div class="outline-text-3" id="text-5-1">
<p>
Setup a new file and namespace for the compojure handlers:
</p>

<div class="org-src-container">

<pre class="src src-clojure">(ns api-for-mortals.server
  (:require [compojure.core :refer :all]
            [compojure.route :as route]
            [clojure.edn :as edn]
            [ring.middleware.json :as json]
            [ring.middleware.params :as params]))
</pre>
</div>

<dl class="org-dl">
<dt>compojure</dt><dd><code>compojure.core</code> has the main functions we need to define routes with compojure and <code>compojure.route</code>
        offers a convenient, premade route to handle missing routes with an 404 HTTP error.</dd>
</dl>


<dl class="org-dl">
<dt>clojure.edn</dt><dd><a href="https://github.com/edn-format/edn">EDN (Extensible Data Notation)</a> is a data format, a subset of the Clojure data notation. It's worth having a look at
it. Here we are only using it to coerce string parameters from HTTP requests to integers via <code>clojure.edn/read-string</code>.</dd>
</dl>


<dl class="org-dl">
<dt>ring.middleware</dt><dd><code>ring.middleware.json</code> we already know, we use it to build proper JSON responses. <code>ring.middleware.params</code> is used to
extract parameters from the request's query string.</dd>
</dl>
</div>
</div>

<div id="outline-container-sec-5-2" class="outline-3">
<h3 id="sec-5-2"><span class="section-number-3">5.2</span> Some functions to produce "meaningful" output</h3>
<div class="outline-text-3" id="text-5-2">
<div class="org-src-container">

<pre class="src src-clojure">(defn rnd-int-in-range [min max]
  (+ min (rand-int (+ (- max min) 1))))

(defn randomizer [min-str max-str]
  (let [min (edn/read-string min-str)
        max (edn/read-string max-str)]
    (rnd-int-in-range min max)))
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-5-3" class="outline-3">
<h3 id="sec-5-3"><span class="section-number-3">5.3</span> Defining routes and their handlers</h3>
<div class="outline-text-3" id="text-5-3">
<p>
A small collection of routes.
</p>
<div class="org-src-container">

<pre class="src src-clojure">(defroutes api-routes
  (GET "/bounce-request" request {:body (dissoc request :body)})
  (GET "/users/:id" [id] {:body {:name "foo" :id id :role "admin"}})
  (GET "/randomizer" [min max] {:body {"randomNumber" (randomizer min max)}})
  (route/not-found {:body {:error "Page not found"}}))
</pre>
</div>

<p>
Wrapping the routes with ring middlewares to get parameters from requests and produce JSON output in the responses.
</p>
<div class="org-src-container">

<pre class="src src-clojure">(def api-app
  (-&gt; api-routes
    params/wrap-params
    json/wrap-json-response))
</pre>
</div>

<p>
Update the entry point for the ring server in <code>project.clj</code>  to use our new, improved handler:
</p>
<div class="org-src-container">

<pre class="src src-clojure">:ring {:handler api-for-mortals.server/api-app}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-5-4" class="outline-3">
<h3 id="sec-5-4"><span class="section-number-3">5.4</span> Complete namespace</h3>
<div class="outline-text-3" id="text-5-4">
<div class="org-src-container">

<pre class="src src-clojure">(ns api-for-mortals.server
  (:require [compojure.core :refer :all]
            [compojure.route :as route]
            [clojure.edn :as edn]
            [ring.middleware.json :as json]
            [ring.middleware.params :as params]))

(defn rnd-int-in-range [min max]
  (+ min (rand-int (+ (- max min) 1))))

(defn randomizer [min-str max-str]
  (let [min (edn/read-string min-str)
        max (edn/read-string max-str)]
    (rnd-int-in-range min max)))

(defroutes api-routes
  (GET "/bounce-request" request {:body (dissoc request :body)})
  (GET "/users/:id" [id] {:body {:name "foo" :id id :role "admin"}})
  (GET "/randomizer" [min max] {:body {"randomNumber" (randomizer min max)}})
  (route/not-found {:body {:error "Page not found"}}))

(def api-app
  (-&gt; api-routes
    params/wrap-params
    json/wrap-json-response))
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Always respond properly: Liberator</h2>
<div class="outline-text-2" id="text-6">
<p>
should I include Liberator?
or maybe just mention it?
I suspect it not to work (well) with swagger
</p>
</div>
</div>
<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> Sweet APIs: Compojure-Swagger</h2>
<div class="outline-text-2" id="text-7">
<p>
<a href="https://github.com/metosin/compojure-api#sample-minimalistic-swaggered-app">https://github.com/metosin/compojure-api#sample-minimalistic-swaggered-app</a>
</p>

<p>
Add the dependencies for the API library and the API testing UI to <code>project.clj</code>:
</p>
<div class="org-src-container">

<pre class="src src-clojure">[metosin/compojure-api "0.17.0"]
[metosin/ring-swagger-ui "2.1.1-M1"]
</pre>
</div>


<div class="org-src-container">

<pre class="src src-clojure">(ns api-for-mortals.swagger
  (:require [ring.util.http-response :refer [ok]]
            [compojure.api.sweet :refer :all]))

(defapi api
  (swagger-ui)
  (swagger-docs)
  (swaggered "jolts"
    :description "My awesome Jolt API"
    (context "/api" []
      (GET* "/jolts/:id" [id]
        (ok {:id id}))
      (POST* "/jolts" []
        :body-params [body :- Long]
        (ok {:data body})))))
</pre>
</div>

<div class="org-src-container">

<pre class="src src-clojure">(require '[api-for-mortals.swagger :as swagger])

(def api-app
  (let [old-routes (-&gt; api-routes
                     params/wrap-params
                     json/wrap-json-response)
        new-routes swagger/api]
    (routes new-routes old-routes)))
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> Authentication and Authorization: Buddy</h2>
<div class="outline-text-2" id="text-8">
<p>
Buddy is a small set of libraries for authentication and authorization including the needed cryptography, hashing and
message signing. If needed these libs can be used independently.
</p>

<p>
Add dependency for 'buddy' meta package, including all these libraries:
</p>

<div class="org-src-container">

<pre class="src src-clojure">[buddy "0.4.1"]
</pre>
</div>

<p>
Buddy supports multiple auth mechanisms, including HTTP basic auth, sessions and tokens, as well as stateless
authentication. We are going to use the latter one.
</p>
</div>
